In [5]:
import os
os.listdir('.')

['.ipynb_checkpoints',
 'divya_unit4 (2).ipynb',
 'generated_data',
 'Heroes of Pymoli',
 'HeroesGenerator.py',
 'players_complete.csv',
 'purchase_data_3.csv',
 'raw_data',
 'untitled',
 'untitled1',
 'untitled2']

In [6]:
import pandas as pd
df = pd.read_csv("purchase_data_3.csv")

In [3]:
### Age Demographics
r = list(range(9,50,5))
r.insert(0,0)
r

[0, 9, 14, 19, 24, 29, 34, 39, 44, 49]

In [4]:
grp_age = df.groupby( pd.cut(df['Age'], r) )

In [8]:
# Age Demo Purch Count
df_count_demo = grp_age['Price'].count()
df_count_demo.rename('Purch_count')

Age
(0, 9]       5
(9, 14]      3
(14, 19]    11
(19, 24]    36
(24, 29]     9
(29, 34]     7
(34, 39]     6
(39, 44]     1
(44, 49]     0
Name: Purch_count, dtype: int64

In [9]:
# Age Demo Avg Purch Price
df_avg_price_demo = grp_age['Price'].mean()
df_avg_price_demo.rename('Avg_purch_price')

Age
(0, 9]      2.764000
(9, 14]     2.986667
(14, 19]    2.764545
(19, 24]    3.024722
(24, 29]    2.901111
(29, 34]    1.984286
(34, 39]    3.561667
(39, 44]    4.650000
(44, 49]         NaN
Name: Avg_purch_price, dtype: float64

In [10]:
# Total Purch Value
df_tot_demo = grp_age['Price'].sum()
df_tot_demo.rename('Total_purch_value')

Age
(0, 9]       13.82
(9, 14]       8.96
(14, 19]     30.41
(19, 24]    108.89
(24, 29]     26.11
(29, 34]     13.89
(34, 39]     21.37
(39, 44]      4.65
(44, 49]      0.00
Name: Total_purch_value, dtype: float64

In [13]:
# Normalized Totals  ???
total_purch = df['Price'].sum()
total_purch

228.10000000000002

In [16]:
df_norm_tot = df_tot_demo / 228.10
df_norm_tot

Age
(0, 9]      0.060587
(9, 14]     0.039281
(14, 19]    0.133319
(19, 24]    0.477378
(24, 29]    0.114467
(29, 34]    0.060894
(34, 39]    0.093687
(39, 44]    0.020386
(44, 49]    0.000000
Name: Price, dtype: float64

In [17]:
### Top Spenders

In [7]:
# df of top 5 spenders
df_tot_purch_by_SN = df.groupby('SN')['Price'].sum()
df_sorted = df_tot_purch_by_SN.sort_values(ascending=False)
df_top5 = df_sorted.iloc[[0,1,2,3,4]] 
df_top5.rename('Top_5_spenders')

SN
Sundaky74     7.41
Aidaira26     5.13
Eusty71       4.81
Chanirra64    4.78
Alarap40      4.71
Name: Top_5_spenders, dtype: float64

In [8]:
top5_SN_list = list(df_top5.index)
df_of_top5 = df[ df['SN'].isin(top5_SN_list) ]
df_of_top5

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
1,1,Aidaira26,21,Male,12,Dawne,3.36
27,27,Sundaky74,25,Male,117,"Heartstriker, Legacy of the Light",4.71
32,32,Alarap40,24,Female,117,"Heartstriker, Legacy of the Light",4.71
48,48,Eusty71,25,Male,84,Arcane Gem,4.81
62,62,Chanirra64,18,Male,25,Hero Cane,4.78
68,68,Aidaira26,21,Male,82,Nirvana,1.77
71,71,Sundaky74,25,Male,60,Wolf,2.70

In [39]:
# create groupby for top5 price
grp_top5_price = df_of_top5.groupby('SN')['Price']

In [41]:
# top 5 Purch Count
df_top5_purch_count = grp_top5_price.count()
df_top5_purch_count

SN
Aerithllora36    1
Aidaira26        2
Alarap40         1
Chanirra64       1
Eusty71          1
Sundaky74        2
Name: Price, dtype: int64

In [42]:
# top 5 avg purch price
df_top5_avg_price = grp_top5_price.mean()
df_top5_avg_price

SN
Aerithllora36    4.650
Aidaira26        2.565
Alarap40         4.710
Chanirra64       4.780
Eusty71          4.810
Sundaky74        3.705
Name: Price, dtype: float64

In [43]:
# top 5 tot purch val
df_top5_purch_value = grp_top5_price.sum()
df_top5_purch_value

SN
Aerithllora36    4.65
Aidaira26        5.13
Alarap40         4.71
Chanirra64       4.78
Eusty71          4.81
Sundaky74        7.41
Name: Price, dtype: float64

In [48]:
# create df table of the above
df_table = pd.DataFrame.from_items([ ('Purch Count', df_top5_purch_count), 
                                    ('Avg Price', df_top5_avg_price), ('Total', df_top5_purch_value) ])
df_table

               Purch Count  Avg Price  Total
SN
Aerithllora36            1      4.650   4.65
Aidaira26                2      2.565   5.13
Alarap40                 1      4.710   4.71
Chanirra64               1      4.780   4.78
Eusty71                  1      4.810   4.81
Sundaky74                2      3.705   7.41

In [ ]:
### Most Popular Items

In [55]:
df_top5_item_id = df.groupby('Item ID')['Item ID'].count()
df_top5_item_id.sort_values(ascending=False)
df_top5_item_id

Item ID
0      1
1      1
2      1
4      1
5      1
6      1
8      1
9      1
10     1
12     1
14     1
16     1
17     1
18     1
23     1
25     1
27     1
31     1
41     1
44     1
60     2
64     2
68     1
70     1
71     1
79     1
82     1
84     1
90     2
91     1
      ..
104    1
105    1
107    1
108    2
111    2
117    2
118    1
123    1
126    2
127    1
129    1
131    1
134    1
138    1
139    1
148    1
154    2
155    1
156    1
158    1
163    1
164    1
167    1
170    1
172    1
173    1
174    1
176    2
180    2
181    1
Name: Item ID, Length: 64, dtype: int64